# Pandas - Nasir Hussain - 17/01/2021

## Chapter 7
#### 7.1 : Handling Missing Data
#### 7.2 : Data Transformation
#### 7.3 : String Manipulation

### 7.1 : Handling Missing Data

- Filtering Out Missing Data
> 1. isnull
> 2. notnull
> 3. dropna
- Filling In Missing Data
> 1. fillna

In [1]:
import pandas as pd
import numpy as np

In [2]:
#Filtering Out Missing Data:

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, None])

In [4]:
string_data.isnull()

0    False
1    False
2     True
3     True
dtype: bool

In [5]:
string_data[string_data.isnull()]

2     NaN
3    None
dtype: object

In [6]:
string_data

0     aardvark
1    artichoke
2          NaN
3         None
dtype: object

In [7]:
string_data.notnull()

0     True
1     True
2    False
3    False
dtype: bool

In [8]:
string_data[string_data.notnull()]

0     aardvark
1    artichoke
dtype: object

In [9]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [10]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
test=data.dropna()

In [12]:
test

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [14]:
data.dropna(inplace=True)

In [15]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],[np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [17]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [19]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [20]:
data.dropna(axis=0,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [21]:
#Filling In Missing Data

In [22]:
df = pd.DataFrame(np.random.randn(7, 3))

In [23]:
df.iloc[:4, 1] = np.nan

In [24]:
df.iloc[:2, 2] = np.nan

In [25]:
df

          0         1         2
0  0.130636       NaN       NaN
1  0.873012       NaN       NaN
2 -1.608525       NaN -0.458545
3  0.393323       NaN  0.045504
4  1.155412 -0.702484  0.401856
5  1.414588  1.083923 -0.972135
6 -0.561390  1.503664 -0.436313

In [26]:
df.fillna(0)

          0         1         2
0  0.130636  0.000000  0.000000
1  0.873012  0.000000  0.000000
2 -1.608525  0.000000 -0.458545
3  0.393323  0.000000  0.045504
4  1.155412 -0.702484  0.401856
5  1.414588  1.083923 -0.972135
6 -0.561390  1.503664 -0.436313

In [27]:
df.fillna({1:0.5,2:0.7})

          0         1         2
0  0.130636  0.500000  0.700000
1  0.873012  0.500000  0.700000
2 -1.608525  0.500000 -0.458545
3  0.393323  0.500000  0.045504
4  1.155412 -0.702484  0.401856
5  1.414588  1.083923 -0.972135
6 -0.561390  1.503664 -0.436313


### 7.2 : Data Transformation

- Removing Duplicated
> 1. duplicated
> 2. drop_duplicated
- Transforming Data Using a Function or Mapping
> 1. map
- Replacing Values
> 1. replace
- Renaming Axis Indexes
> 1. rename
- Discretization And Binning
> 1. cut
- Detecting And Filtering Outliers

In [28]:
# Removing Duplicated

In [29]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 1, 3, 3, 4, 4]})

In [30]:
data

    k1  k2
0  one   1
1  two   1
2  one   1
3  two   3
4  one   3
5  two   4
6  two   4

In [31]:
data.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
dtype: bool

In [32]:
data[data.duplicated()]

    k1  k2
2  one   1
6  two   4

In [33]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
3  two   3
4  one   3
5  two   4

In [34]:
data['v1'] = range(7)

In [35]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   1   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [36]:
data.duplicated(['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [37]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [38]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
1  two   1   1
2  one   1   2
3  two   3   3
4  one   3   4
6  two   4   6

In [39]:
#Transforming Data Using A Function Or Mapping

In [40]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [41]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [42]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [43]:
lowercased = data['food'].str.lower()

In [44]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [45]:
data['animal1'] = lowercased.map(meat_to_animal)

In [46]:
data

          food  ounces animal1
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [47]:
data['animal']=data['food'].map(lambda x: meat_to_animal[x.lower()]) #one line code

In [48]:
data

          food  ounces animal1  animal
0        bacon     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2        bacon    12.0     pig     pig
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

In [49]:
#Replacing Values

In [50]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [51]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [52]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [53]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [54]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [55]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

# Discretization and Binning

In [56]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [57]:
bins = [18, 25, 35, 60, 100]

In [58]:
cats = pd.cut(ages, bins)

In [59]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [60]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [61]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [62]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

# Detecting and Filtering Outliers

In [63]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [64]:
data.head(20)

           0         1         2         3
0  -1.088057 -0.761237  0.061414 -0.724488
1  -1.801684  0.059783 -0.509773 -0.815679
2  -0.272781  0.519658 -0.012456 -0.491086
3   0.802297  0.068419  0.534179 -0.269778
4  -0.117208  1.604750 -0.515512  0.078011
5  -1.691449  0.766168 -1.250275  0.006306
6   0.650662 -0.064721  0.318057  1.776674
7   0.337566  1.251759 -1.331364 -1.126821
8  -0.043042  0.692487 -0.306220  0.203559
9  -0.694836  0.208164 -1.185965  0.237186
10 -0.668776  1.017465 -0.067003  0.146275
11 -0.038058  0.047386  0.638098 -0.815314
12 -1.755762  0.595733 -0.172973  0.568762
13  0.247265 -0.596801 -0.001461  1.474602
14 -0.782287  1.056901  2.821612 -0.878998
15 -0.527955  0.233286 -1.396405  2.151743
16 -1.046200 -0.420295 -0.245990 -0.241427
17 -0.669411 -0.994300  0.137513  1.200376
18 -0.331666 -2.340260  1.352813  0.515271
19 -0.279874  0.410508 -1.702302 -1.010942

In [65]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.024781     0.006517    -0.026794     0.032846
std       0.985182     0.952704     0.976843     1.028223
min      -2.761295    -3.243506    -2.829640    -3.294642
25%      -0.701616    -0.640463    -0.649912    -0.647572
50%      -0.017793     0.022041    -0.025540     0.026557
75%       0.644639     0.652328     0.640764     0.723244
max       2.781370     3.078050     3.385341     3.074570

In [66]:
col = data[1]

In [67]:
col.head(15)

0    -0.761237
1     0.059783
2     0.519658
3     0.068419
4     1.604750
5     0.766168
6    -0.064721
7     1.251759
8     0.692487
9     0.208164
10    1.017465
11    0.047386
12    0.595733
13   -0.596801
14    1.056901
Name: 1, dtype: float64

In [68]:
col[np.abs(col) > 3]

217   -3.243506
780    3.078050
828   -3.233008
Name: 1, dtype: float64

In [69]:
np.sign(data)

       0    1    2    3
0   -1.0 -1.0  1.0 -1.0
1   -1.0  1.0 -1.0 -1.0
2   -1.0  1.0 -1.0 -1.0
3    1.0  1.0  1.0 -1.0
4   -1.0  1.0 -1.0  1.0
..   ...  ...  ...  ...
995 -1.0  1.0  1.0  1.0
996  1.0 -1.0 -1.0 -1.0
997 -1.0  1.0  1.0  1.0
998  1.0  1.0  1.0  1.0
999  1.0  1.0 -1.0  1.0

[1000 rows x 4 columns]

In [70]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
217 -1.435753 -3.243506 -0.309207  0.658527
239 -0.370616  1.071346  0.871892  3.074570
501  0.921189 -1.363972  3.385341  2.147905
639 -0.530923 -0.064456  3.107337 -2.999067
699  0.374690 -0.413773  0.047813 -3.049823
738 -1.077198  0.500590 -0.391040 -3.294642
780  1.891267  3.078050 -0.428271 -0.127932
828 -0.603535 -3.233008 -0.495382 -1.072290

In [71]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [72]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.024781     0.006915    -0.027286     0.033116
std       0.985182     0.950889     0.975232     1.026944
min      -2.761295    -3.000000    -2.829640    -3.000000
25%      -0.701616    -0.640463    -0.649912    -0.647572
50%      -0.017793     0.022041    -0.025540     0.026557
75%       0.644639     0.652328     0.640764     0.723244
max       2.781370     3.000000     3.000000     3.000000



### 7.3 : String Manipulation

- Regular Expressions
> 1. regex

In [73]:
#Regular Expressions

In [74]:
import re
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._+-]+@[A-Z0-9.-]+.[A-Z]{2,4}' #text@text.pk

In [75]:
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [76]:
regex

re.compile(r'[A-Z0-9._+-]+@[A-Z0-9.-]+.[A-Z]{2,4}', re.IGNORECASE|re.UNICODE)

In [77]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [78]:
np.broadcast_arrays()

[]

<img src>